### Prepared by Abhishek Kumar
### https://www.linkedin.com/in/abhishek-kumar-442337b2/

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# To get multiple outputs in the same cell

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

%matplotlib inline

In [3]:
# Setup : DataFrame creation

salary = [['1','Abhishek Kumar','AIML', 'Machine Learning Engineer','M', 'Y', '04051990', 1121000],
          ['2','Arjun Kumar','DM', 'Tech Lead','M', 'Y', '09031992', 109000],
          ['3','Vivek Raj','DM', 'Devops Engineer','M', 'N', np.NaN , 827000],
          ['4','Mika Singh','DM', 'Data Analyst','F', 'Y', '15101991',  np.NaN],
          ['5','Anusha Yenduri','AIML', 'Data Scientist','F', 'Y', '01011989',  921000],
          ['6','Ritesh Srivastava','AIML', 'Data Engineer','M', 'Y', np.NaN, 785000]]

columns_name=['Emp_Id','Emp_Name','Department','Role','Gender', 'WFH Status', 'DOB', 'Salary']

emp_df = pd.DataFrame(salary,columns=columns_name)
emp_df

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

# 1. Group By: Split-Apply-Combine


    i. df.groupby()
    ii. .apply() , .agg(), .filter()
    iii.

In [4]:
emp_df_1 = emp_df.copy()
emp_df_1

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

In [5]:
grouped_1 = emp_df_1.groupby('Department')
grouped_1

## 1.1 Meta Methods

    Meta methods are less concerned with the original object on which .groupby() is called.
    Mainly provide high-level information such as the number of groups and indices of those groups.

In [6]:
grouped_1.groups

{'AIML': Int64Index([0, 4, 5], dtype='int64'),
 'DM': Int64Index([1, 2, 3], dtype='int64')}

In [7]:
grouped_1.get_group('DM')

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN

In [8]:
grouped_1.indices

{'AIML': array([0, 4, 5], dtype=int64), 'DM': array([1, 2, 3], dtype=int64)}

In [9]:
grouped_1.ndim

2

In [10]:
grouped_1.ngroups

2

In [11]:
grouped_1.ngroup()

0    0
1    1
2    1
3    1
4    0
5    0
dtype: int64

In [12]:
grouped_1.dtypes

            Emp_Id Emp_Name    Role  Gender WFH Status     DOB   Salary
Department
AIML        object   object  object  object     object  object  float64
DM          object   object  object  object     object  object  float64

In [13]:
#for i in range(2):
#    grouped_1.__iter__()

In [14]:
grouped_1.size()

Department
AIML    3
DM      3
dtype: int64

In [15]:
len(grouped_1)

2

## 1.2 Filter Methods

    Filter methods return a subset of the original DataFrame. 
    Most common is .filter() to drop entire groups based on some comparative statistic about that group and its sub-table. 
    There are a number of methods that exclude particular rows from each group.

In [16]:
grouped_2 = emp_df_1.groupby('Department')
grouped_2

In [17]:
grouped_2.first()

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
DM,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0

In [18]:
grouped_2.last()

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,01011989,785000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,827000.0

In [19]:
grouped_2.head(2)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0

In [20]:
grouped_2.tail(1)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

In [21]:
# Take the nth row from each group if n is an int, or a subset of rows if n is a list of ints.

grouped_2.nth(2)

grouped_2.nth([0,2])

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,NaN

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0
DM,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,NaN

In [22]:
# we are selecting the 0th and 2nd rows, not rows whose indices equal 0 and 2.

grouped_2.take([0,2])

             Emp_Id           Emp_Name                       Role Gender  \
Department
AIML       0      1     Abhishek Kumar  Machine Learning Engineer      M
           5      6  Ritesh Srivastava              Data Engineer      M
DM         1      2        Arjun Kumar                  Tech Lead      M
           3      4         Mika Singh               Data Analyst      F

             WFH Status       DOB     Salary
Department
AIML       0          Y  04051990  1121000.0
           5          Y       NaN   785000.0
DM         1          Y  09031992   109000.0
           3          Y  15101991        NaN

In [23]:
# The argument of filter must be a function that, applied to the group as a whole, returns True or False.

grouped_1.filter(lambda x: len(x['Emp_Id']) >= 3)

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0

In [24]:
# The argument of filter must be a function that, applied to the group as a whole, returns True or False.

grouped_2.filter(lambda x: sum(x['Salary']) >= 950000)

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
4,5,Anusha Yenduri,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0

## 1.3 Aggregation Methods

    Aggregation methods (also called reduction methods) “smush” many data points into an aggregated statistic about those data points.
    An example is to take the sum, mean, or median of 10 numbers, where the result is just a single number.

In [25]:
grouped_3 = emp_df_1.groupby('Department')
grouped_3

In [26]:
# grouped_3.agg(np.sum)

grouped_3.agg('sum')

               Salary
Department
AIML        2827000.0
DM           936000.0

In [27]:
grouped_3.agg('mean')

                   Salary
Department
AIML        942333.333333
DM          468000.000000

### + Applying multiple functions at once

In [28]:
x= grouped_3.agg(['max','mean', 'min'])
x

               Salary
                  max           mean       min
Department
AIML        1121000.0  942333.333333  785000.0
DM           827000.0  468000.000000  109000.0

### - End

### + Analysing the aggregated result dataframe

In [29]:
x.ndim

2

In [30]:
x.size

6

In [31]:
x.shape

(2, 3)

In [32]:
len(x)

2

In [33]:
x.iloc[:,2:]

              Salary
                 min
Department
AIML        785000.0
DM          109000.0

In [34]:
x.columns
x.columns[0]

MultiIndex([('Salary',  'max'),
            ('Salary', 'mean'),
            ('Salary',  'min')],
           )

('Salary', 'max')

In [35]:
x.index
x.index[0]

Index(['AIML', 'DM'], dtype='object', name='Department')

'AIML'

### - End

In [36]:
# as_index = False does not create the groupby columns as Indexes

grouped_3a = emp_df_1.groupby(['Department','Gender'], as_index = False)
grouped_3a

In [37]:
grouped_3a.agg('sum')
grouped_3a['Salary'].agg(['sum'])

  Department Gender     Salary
0       AIML      F   921000.0
1       AIML      M  1906000.0
2         DM      F        0.0
3         DM      M   936000.0

                         sum
Department Gender
AIML       F        921000.0
           M       1906000.0
DM         F             0.0
           M        936000.0

In [38]:
# We can also use the reset_index DataFrame function to achieve the same result as the column names are stored in the resulting MultiIndex

emp_df_1.groupby(['Department','Gender']).sum().reset_index()

  Department Gender     Salary
0       AIML      F   921000.0
1       AIML      M  1906000.0
2         DM      F        0.0
3         DM      M   936000.0

In [39]:
grouped_3a.size()
grouped_3a.size().reset_index()

Department  Gender
AIML        F         1
            M         2
DM          F         1
            M         2
dtype: int64

  Department Gender  0
0       AIML      F  1
1       AIML      M  2
2         DM      F  1
3         DM      M  2

In [40]:
grouped_3a.describe()

  Salary                                                                    \
   count      mean            std       min       25%       50%        75%
0    1.0  921000.0            NaN  921000.0  921000.0  921000.0   921000.0
1    2.0  953000.0  237587.878479  785000.0  869000.0  953000.0  1037000.0
2    0.0       NaN            NaN       NaN       NaN       NaN        NaN
3    2.0  468000.0  507702.668892  109000.0  288500.0  468000.0   647500.0


         max
0   921000.0
1  1121000.0
2        NaN
3   827000.0

In [41]:
grouped_3a.aggregate('count')
grouped_3a.count()
grouped_3a.agg(lambda x: x.count())

  Department Gender  Emp_Id  Emp_Name  Role  WFH Status  DOB  Salary
0       AIML      F       1         1     1           1    1       1
1       AIML      M       2         2     2           2    1       2
2         DM      F       1         1     1           1    1       0
3         DM      M       2         2     2           2    1       2

  Department Gender  Emp_Id  Emp_Name  Role  WFH Status  DOB  Salary
0       AIML      F       1         1     1           1    1       1
1       AIML      M       2         2     2           2    1       2
2         DM      F       1         1     1           1    1       0
3         DM      M       2         2     2           2    1       2

  Department Gender  Emp_Id  Emp_Name  Role  WFH Status  DOB  Salary
0       AIML      F       1         1     1           1    1     1.0
1       AIML      M       2         2     2           2    1     2.0
2         DM      F       1         1     1           1    1     0.0
3         DM      M       2         2     2           2    1     2.0

In [42]:
grouped_3a['Salary'].aggregate('count')
grouped_3a['Salary'].count()
grouped_3a['Salary'].agg(lambda x: x.count())

  Department Gender  Salary
0       AIML      F       1
1       AIML      M       2
2         DM      F       0
3         DM      M       2

  Department Gender  Salary
0       AIML      F       1
1       AIML      M       2
2         DM      F       0
3         DM      M       2

  Department Gender  Salary
0       AIML      F     1.0
1       AIML      M     2.0
2         DM      F     0.0
3         DM      M     2.0

#### Note: The aggregating functions above will exclude NA values.

### Renaming column labels

    i. .rename()
    ii. Named Aggregation

#### i. .rename()

In [43]:
grouped_3b = emp_df_1.groupby(['Department','Gender'])
grouped_3b

In [44]:
grouped_3b.agg(['min','max','mean'])
grouped_3b.agg(['min','max','mean']).rename(columns = { 'min' : 'Least', 'max': 'Most', 'mean':'Avg'})

                     Salary
                        min        max      mean
Department Gender
AIML       F       921000.0   921000.0  921000.0
           M       785000.0  1121000.0  953000.0
DM         F            NaN        NaN       NaN
           M       109000.0   827000.0  468000.0

                     Salary
                      Least       Most       Avg
Department Gender
AIML       F       921000.0   921000.0  921000.0
           M       785000.0  1121000.0  953000.0
DM         F            NaN        NaN       NaN
           M       109000.0   827000.0  468000.0

#### ii. NamedAggregation

    To support column-specific aggregation with control over the output column names, pandas accepts the special syntax in GroupBy.agg(), known as “named aggregation”, where

    i. The keywords are the output column names

    ii. The values are tuples whose first element is the column to select and the second element is the aggregation to apply to that column.
    
    iii. Pandas provides the pandas.NamedAgg namedtuple with the fields ['column', 'aggfunc'] to make it clearer what the arguments are. As usual, the aggregation can be a callable or a string alias.

In [45]:
# Named Tuple

grouped_3b.agg( Max_Sal = pd.NamedAgg( column = 'Salary' , aggfunc = 'max'),
                Min_Sal = pd.NamedAgg( column = 'Salary' , aggfunc = 'min'),
                Avg_Sal = pd.NamedAgg( column = 'Salary' , aggfunc = 'mean'))


# Plain Tuple
# Also, the index is reset here.

grouped_3b.agg( Max_Sal = pd.NamedAgg( 'Salary' ,  'max'),
                Min_Id = pd.NamedAgg( 'Emp_Id' ,  'min'),
                Avg_Sal = pd.NamedAgg( 'Salary' ,  'mean')).reset_index()

                     Max_Sal   Min_Sal   Avg_Sal
Department Gender
AIML       F        921000.0  921000.0  921000.0
           M       1121000.0  785000.0  953000.0
DM         F             NaN       NaN       NaN
           M        827000.0  109000.0  468000.0

  Department Gender    Max_Sal Min_Id   Avg_Sal
0       AIML      F   921000.0      5  921000.0
1       AIML      M  1121000.0      1  953000.0
2         DM      F        NaN      4       NaN
3         DM      M   827000.0      2  468000.0

### Applying different functions to DataFrame columns

    By passing a dict to aggregate we can apply a different aggregation to the columns of a DataFrame

In [46]:
grouped_3b.agg({ 'Salary' : lambda x: np.std(x, ddof=1)})

# index on Groupby columns is also reset.
grouped_3b.agg({ 'Salary' : 'mean', 'Role' : 'sum'}).reset_index()

                          Salary
Department Gender
AIML       F                 NaN
           M       237587.878479
DM         F                 NaN
           M       507702.668892

  Department Gender    Salary                                    Role
0       AIML      F  921000.0                          Data Scientist
1       AIML      M  953000.0  Machine Learning EngineerData Engineer
2         DM      F       NaN                            Data Analyst
3         DM      M  468000.0                Tech LeadDevops Engineer

## 1.4 Transformation

    Transformation methods return a DataFrame with the same shape and indices as the original, but with different values. 
    With both aggregation & filter methods, the resulting DataFrame will commonly be smaller in size than the input DF. 
    This is not true of a transformation, which transforms individual values themselves but retains d shape of the original DataFrame.

In [47]:
grouped_3c = emp_df_1.groupby(['Department'])
grouped_3c.count()

            Emp_Id  Emp_Name  Role  Gender  WFH Status  DOB  Salary
Department
AIML             3         3     3       3           3    2       3
DM               3         3     3       3           3    2       2

In [48]:
transformed = grouped_3c.transform(lambda x : x.fillna(x.mean()))
transformed

  Emp_Id     Salary
0      1  1121000.0
1      2   109000.0
2      3   827000.0
3      4   468000.0
4      5   921000.0
5      6   785000.0

In [49]:
grouped_trans = transformed.groupby(level=0)
grouped_trans.count()

   Emp_Id  Salary
0       1       1
1       1       1
2       1       1
3       1       1
4       1       1
5       1       1

### + Window and resample operations

    i. rolling()
    ii. expanding()
    iii. resample()

In [50]:
df_re = pd.DataFrame({'A': [1] * 10 + [5] * 10,
                      'B': np.arange(20)})
df_re.head()
df_re.tail()

   A  B
0  1  0
1  1  1
2  1  2
3  1  3
4  1  4

    A   B
15  5  15
16  5  16
17  5  17
18  5  18
19  5  19

In [51]:
# This will apply the rolling() method on the samples of the column B based on the groups of column A.

df_re.groupby('A').rolling(4).B.sum()

A
1  0      NaN
   1      NaN
   2      NaN
   3      6.0
   4     10.0
   5     14.0
   6     18.0
   7     22.0
   8     26.0
   9     30.0
5  10     NaN
   11     NaN
   12     NaN
   13    46.0
   14    50.0
   15    54.0
   16    58.0
   17    62.0
   18    66.0
   19    70.0
Name: B, dtype: float64

In [52]:
# The expanding() method will accumulate a given operation (sum() in the example) for all the members of each particular group.

df_re.groupby('A').expanding().B.sum()

A
1  0       0.0
   1       1.0
   2       3.0
   3       6.0
   4      10.0
   5      15.0
   6      21.0
   7      28.0
   8      36.0
   9      45.0
5  10     10.0
   11     21.0
   12     33.0
   13     46.0
   14     60.0
   15     75.0
   16     91.0
   17    108.0
   18    126.0
   19    145.0
Name: B, dtype: float64

In [53]:
# ReSampling is not yet covered...

### References:

#### 1. [Pandas Documentation](#https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)
#### 2. [Real Python](#https://realpython.com/pandas-groupby/)
#### 3. [TDS - Window Functions](#https://towardsdatascience.com/window-functions-in-pandas-eaece0421f7)